/* English Localization for A6Cutter */

// Main UI
"Posunuti rezu" = "Cut Shifts";
"Horizontální posun" = "Horizontal Shift";
"Vertikální posun" = "Vertical Shift";
"Vynechání stránek" = "Skip Pages";
"Čísla stránek" = "Page numbers";
"Otočení" = "Rotation";
"Otočit z landscape na portrait" = "Rotate from landscape to portrait";
"Směr otáčení" = "Rotation Direction";
"Po směru hodinových ručiček" = "Clockwise";
"Proti směru hodinových ručiček" = "Counter-clockwise";
"Řezání" = "Cutting";
"Vypnout řezání" = "Disable Cutting";
"Počet stránek" = "Page Count";
"Uložit PDF" = "Save PDF";
"Náhled v Preview" = "Preview";
"Tisk" = "Print";
"Otevřít PDF" = "Open PDF";
"Enable modifications" = "Enable modifications";
"Disabled modification" = "Disabled modification";
"Presety" = "Presets";
"Náhled všech stránek" = "Preview of all pages";
"Str." = "Page";
"VYNECHÁNO" = "SKIPPED";

// Debug messages
"Začínám zpracování PDF..." = "Starting PDF processing...";
"KROK 1: Otočuji landscape stránky na portrait..." = "STEP 1: Rotating landscape pages to portrait...";
"KROK 2: Řezání je vypnuto - pouze otočení" = "STEP 2: Cutting disabled - rotation only";
"KROK 2: Řezání stránek na A6 dlaždice..." = "STEP 2: Cutting pages into A6 tiles...";
"KROK 3: Vynechání stránek podle filtru" = "STEP 3: Skipping pages according to filter";
"Počet stránek v původním PDF" = "Number of pages in original PDF";
"Stránka" = "Page";
"bodů" = "points";
"Po otočení" = "After rotation";
"A6 landscape rozměry" = "A6 landscape dimensions";
"A6 portrait rozměry" = "A6 portrait dimensions";
"Rozdělení" = "Division";
"dlaždic" = "tiles";
"velikost dlaždice" = "tile size";
"Horizontální posun" = "Horizontal shift";
"Vertikální posun" = "Vertical shift";
"Přidána stránka" = "Added page";
"Dokončeno! Celkem vytvořeno" = "Completed! Total created";
"stránek" = "pages";
"KROK 3: Aplikuji vynechání stránek na konečný výsledek" = "STEP 3: Applying page skipping to final result";
"Přeskakuji stránku" = "Skipping page";
"v konečném výsledku" = "in final result";
"Přidána stránka" = "Added page";
"do konečného výsledku" = "to final result";
"PDF úspěšně rozřezán na A6, nový počet stránek" = "PDF successfully cut to A6, new page count";
"PDF úspěšně regenerován s novými nastaveními (bez vynechání), nový počet stránek" = "PDF successfully regenerated with new settings (without skipping), new page count";
"Regeneruji PDF s novými nastaveními (bez vynechání stránek pro preview)..." = "Regenerating PDF with new settings (without page skipping for preview)...";
"Aktuální nastavení" = "Current settings";
"hShift" = "hShift";
"vShift" = "vShift";
"skip" = "skip";
"rotate" = "rotate";
"disable" = "disable";
"clockwise" = "clockwise";
"Regenerace PDF přeskočena - žádný původní dokument" = "PDF regeneration skipped - no original document";
"PDFThumbnailsView se aktualizuje - počet stránek" = "PDFThumbnailsView updating - page count";
"PDFThumbnailsView se ukončuje" = "PDFThumbnailsView terminating";
"Otevírám PDF v Preview..." = "Opening PDF in Preview...";
"Otevírám PDF v Preview s aplikováním filtru vynechání stránek..." = "Opening PDF in Preview with page skipping filter applied...";
"Přeskakuji stránku" = "Skipping page";
"v preview" = "in preview";
"Přidána stránka" = "Added page";
"do preview" = "to preview";
"Preview bude obsahovat" = "Preview will contain";
"stránek (původně" = "pages (originally";
"Nelze získat data z PDF dokumentu" = "Cannot get data from PDF document";
"PDF uloženo do dočasného souboru" = "PDF saved to temporary file";
"Filtrované PDF uloženo do dočasného souboru" = "Filtered PDF saved to temporary file";
"Dočasný soubor smazán" = "Temporary file deleted";
"Chyba při ukládání PDF pro preview" = "Error saving PDF for preview";
"Chyba při ukládání filtrovaného PDF pro preview" = "Error saving filtered PDF for preview";
"Nelze získat data z filtrovaného PDF dokumentu" = "Cannot get data from filtered PDF document";
"Otevírám PDF v Preview..." = "Opening PDF in Preview...";
"Ukládám PDF..." = "Saving PDF...";
"Nastavení uložena" = "Settings saved";
"Nastavení načtena" = "Settings loaded";
"Chyba při ukládání" = "Error saving";
